7767517
78 94
Input                    in0                      0 1 in0
Convolution              conv_2                   1 1 in0 1 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432
Swish                    silu_29                  1 1 1 2
Convolution              conv_3                   1 1 2 3 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=4608
Swish                    silu_30                  1 1 3 4
Convolution              conv_4                   1 1 4 5 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_31                  1 1 5 6
Slice                    split_0                  1 2 6 7 8 -23300=2,16,16 1=0
Split                    splitncnn_0              1 3 8 9 10 11
Convolution              conv_5                   1 1 11 12 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_32                  1 1 12 13
Convolution              conv_6                   1 1 13 14 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_33                  1 1 14 15
BinaryOp                 add_0                    2 1 10 15 16 0=0
Concat                   cat_0                    3 1 7 9 16 17 0=0
Convolution              conv_7                   1 1 17 18 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536
Swish                    silu_34                  1 1 18 19
Convolution              conv_8                   1 1 19 20 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=18432
Swish                    silu_35                  1 1 20 21
Convolution              conv_9                   1 1 21 22 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_36                  1 1 22 23
Slice                    split_1                  1 2 23 24 25 -23300=2,32,32 1=0
Split                    splitncnn_1              1 3 25 26 27 28
Convolution              conv_10                  1 1 28 29 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_37                  1 1 29 30
Convolution              conv_11                  1 1 30 31 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_38                  1 1 31 32
BinaryOp                 add_1                    2 1 27 32 33 0=0
Split                    splitncnn_2              1 3 33 34 35 36
Convolution              conv_12                  1 1 36 37 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_39                  1 1 37 38
Convolution              conv_13                  1 1 38 39 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_40                  1 1 39 40
BinaryOp                 add_2                    2 1 35 40 41 0=0
Concat                   cat_1                    4 1 24 26 34 41 42 0=0
Convolution              conv_14                  1 1 42 43 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_41                  1 1 43 44
Convolution              conv_15                  1 1 44 45 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=73728
Swish                    silu_42                  1 1 45 46
Convolution              conv_16                  1 1 46 47 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_43                  1 1 47 48
Slice                    split_2                  1 2 48 49 50 -23300=2,64,64 1=0
Split                    splitncnn_3              1 3 50 51 52 53
Convolution              conv_17                  1 1 53 54 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_44                  1 1 54 55
Convolution              conv_18                  1 1 55 56 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_45                  1 1 56 57
BinaryOp                 add_3                    2 1 52 57 58 0=0
Split                    splitncnn_4              1 3 58 59 60 61
Convolution              conv_19                  1 1 61 62 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_46                  1 1 62 63
Convolution              conv_20                  1 1 63 64 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_47                  1 1 64 65
BinaryOp                 add_4                    2 1 60 65 66 0=0
Concat                   cat_2                    4 1 49 51 59 66 67 0=0
Convolution              conv_21                  1 1 67 68 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_48                  1 1 68 69
Convolution              conv_22                  1 1 69 70 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=294912
Swish                    silu_49                  1 1 70 71
Convolution              conv_23                  1 1 71 72 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_50                  1 1 72 73
Slice                    split_3                  1 2 73 74 75 -23300=2,128,128 1=0
Split                    splitncnn_5              1 3 75 76 77 78
Convolution              conv_24                  1 1 78 79 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_51                  1 1 79 80
Convolution              conv_25                  1 1 80 81 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_52                  1 1 81 82
BinaryOp                 add_5                    2 1 77 82 83 0=0
Concat                   cat_3                    3 1 74 76 83 84 0=0
Convolution              conv_26                  1 1 84 85 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_53                  1 1 85 86
Convolution              conv_27                  1 1 86 87 0=1280 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=327680
Swish                    silu_54                  1 1 87 88
Pooling                  gap_1                    1 1 88 89 0=1 4=1
Reshape                  reshape_55               1 1 89 90 0=1 1=1 2=-1
Flatten                  flatten_56               1 1 90 91
InnerProduct             linear_28                1 1 91 92 0=1000 1=1 2=1280000
Softmax                  softmax_0                1 1 92 out0 0=0 1=1
