7767517
270 318
Input                    in0                      0 1 in0
Convolution              conv_6                   1 1 in0 1 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=864
Swish                    silu_77                  1 1 1 2
Convolution              conv_7                   1 1 2 3 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=18432
Swish                    silu_78                  1 1 3 4
Convolution              conv_8                   1 1 4 5 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_79                  1 1 5 6
Slice                    split_0                  1 2 6 7 8 -23300=2,32,32 1=0
Split                    splitncnn_0              1 3 8 9 10 11
Convolution              conv_9                   1 1 11 12 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_80                  1 1 12 13
Convolution              conv_10                  1 1 13 14 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_81                  1 1 14 15
BinaryOp                 add_0                    2 1 10 15 16 0=0
Concat                   cat_0                    3 1 7 9 16 17 0=0
Convolution              conv_11                  1 1 17 18 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144
Swish                    silu_82                  1 1 18 19
Convolution              conv_12                  1 1 19 20 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=73728
Swish                    silu_83                  1 1 20 21
Convolution              conv_13                  1 1 21 22 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_84                  1 1 22 23
Slice                    split_1                  1 2 23 24 25 -23300=2,64,64 1=0
Split                    splitncnn_1              1 3 25 26 27 28
Convolution              conv_14                  1 1 28 29 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_85                  1 1 29 30
Convolution              conv_15                  1 1 30 31 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_86                  1 1 31 32
BinaryOp                 add_1                    2 1 27 32 33 0=0
Split                    splitncnn_2              1 3 33 34 35 36
Convolution              conv_16                  1 1 36 37 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_87                  1 1 37 38
Convolution              conv_17                  1 1 38 39 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_88                  1 1 39 40
BinaryOp                 add_2                    2 1 35 40 41 0=0
Concat                   cat_1                    4 1 24 26 34 41 42 0=0
Convolution              conv_18                  1 1 42 43 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_89                  1 1 43 44
Split                    splitncnn_3              1 2 44 45 46
Convolution              conv_19                  1 1 46 47 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=294912
Swish                    silu_90                  1 1 47 48
Convolution              conv_20                  1 1 48 49 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_91                  1 1 49 50
Slice                    split_2                  1 2 50 51 52 -23300=2,128,128 1=0
Split                    splitncnn_4              1 3 52 53 54 55
Convolution              conv_21                  1 1 55 56 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_92                  1 1 56 57
Convolution              conv_22                  1 1 57 58 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_93                  1 1 58 59
BinaryOp                 add_3                    2 1 54 59 60 0=0
Split                    splitncnn_5              1 3 60 61 62 63
Convolution              conv_23                  1 1 63 64 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_94                  1 1 64 65
Convolution              conv_24                  1 1 65 66 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_95                  1 1 66 67
BinaryOp                 add_4                    2 1 62 67 68 0=0
Concat                   cat_2                    4 1 51 53 61 68 69 0=0
Convolution              conv_25                  1 1 69 70 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_96                  1 1 70 71
Split                    splitncnn_6              1 2 71 72 73
Convolution              conv_26                  1 1 73 74 0=512 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1179648
Swish                    silu_97                  1 1 74 75
Convolution              conv_27                  1 1 75 76 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_98                  1 1 76 77
Slice                    split_3                  1 2 77 78 79 -23300=2,256,256 1=0
Split                    splitncnn_7              1 3 79 80 81 82
Convolution              conv_28                  1 1 82 83 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_99                  1 1 83 84
Convolution              conv_29                  1 1 84 85 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_100                 1 1 85 86
BinaryOp                 add_5                    2 1 81 86 87 0=0
Concat                   cat_3                    3 1 78 80 87 88 0=0
Convolution              conv_30                  1 1 88 89 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=393216
Swish                    silu_101                 1 1 89 90
Convolution              conv_31                  1 1 90 91 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_102                 1 1 91 92
Split                    splitncnn_8              1 2 92 93 94
Pooling                  maxpool2d_74             1 1 94 95 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_9              1 2 95 96 97
Pooling                  maxpool2d_75             1 1 97 98 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_10             1 2 98 99 100
Pooling                  maxpool2d_76             1 1 100 101 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_4                    4 1 93 96 99 101 102 0=0
Convolution              conv_32                  1 1 102 103 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_103                 1 1 103 104
Split                    splitncnn_11             1 2 104 105 106
Interp                   upsample_134             1 1 106 107 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_5                    2 1 107 72 108 0=0
Convolution              conv_33                  1 1 108 109 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=196608
Swish                    silu_104                 1 1 109 110
Slice                    chunk_0                  1 2 110 111 112 -23300=2,-233,-233 1=0
Split                    splitncnn_12             1 2 112 113 114
Convolution              conv_34                  1 1 114 115 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_105                 1 1 115 116
Convolution              conv_35                  1 1 116 117 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_106                 1 1 117 118
Split                    splitncnn_13             1 3 118 119 120 121
MemoryData               pnnx_fold_455            0 1 122 0=32 1=4 2=80
Reshape                  view_137                 1 1 121 123 0=40 1=40 11=32 2=4
Einsum                   einsum_0                 2 1 123 122 124 -23300=14,105,109,106,107,44,108,105,109,45,62,105,106,107,108
Reduction                max_154                  1 1 124 125 0=4 1=0 -23303=1,-1 4=0 5=1
MemoryData               pnnx_fold_466            0 1 126 0=1 1=1 2=4
BinaryOp                 div_6                    1 1 125 127 0=3 1=1 2=5.656854e+00
BinaryOp                 add_7                    2 1 127 126 128 0=0
Sigmoid                  sigmoid_0                1 1 128 129
Convolution              conv_36                  1 1 120 130 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Reshape                  view_138                 1 1 130 131 0=40 1=40 11=32 2=4
ExpandDims               unsqueeze_159            1 1 129 132 -23303=1,1
BinaryOp                 mul_8                    2 1 131 132 133 0=2
Reshape                  view_139                 1 1 133 134 0=40 1=40 2=128
Concat                   cat_6                    4 1 111 113 119 134 135 0=0
Convolution              conv_37                  1 1 135 136 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_107                 1 1 136 137
Split                    splitncnn_14             1 2 137 138 139
Interp                   upsample_135             1 1 139 140 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_7                    2 1 140 45 141 0=0
Convolution              conv_38                  1 1 141 142 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=49152
Swish                    silu_108                 1 1 142 143
Slice                    chunk_1                  1 2 143 144 145 -23300=2,-233,-233 1=0
Split                    splitncnn_15             1 2 145 146 147
Convolution              conv_39                  1 1 147 148 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_109                 1 1 148 149
Convolution              conv_40                  1 1 149 150 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_110                 1 1 150 151
Split                    splitncnn_16             1 3 151 152 153 154
MemoryData               pnnx_fold_545            0 1 155 0=32 1=2 2=80
Reshape                  view_140                 1 1 154 156 0=80 1=80 11=32 2=2
Einsum                   einsum_1                 2 1 156 155 157 -23300=14,105,109,106,107,44,108,105,109,45,62,105,106,107,108
Reduction                max_155                  1 1 157 158 0=4 1=0 -23303=1,-1 4=0 5=1
MemoryData               pnnx_fold_556            0 1 159 0=1 1=1 2=2
BinaryOp                 div_9                    1 1 158 160 0=3 1=1 2=5.656854e+00
BinaryOp                 add_10                   2 1 160 159 161 0=0
Sigmoid                  sigmoid_1                1 1 161 162
Convolution              conv_41                  1 1 153 163 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Reshape                  view_141                 1 1 163 164 0=80 1=80 11=32 2=2
ExpandDims               unsqueeze_160            1 1 162 165 -23303=1,1
BinaryOp                 mul_11                   2 1 164 165 166 0=2
Reshape                  view_142                 1 1 166 167 0=80 1=80 2=64
Concat                   cat_8                    4 1 144 146 152 167 168 0=0
Convolution              conv_42                  1 1 168 169 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_111                 1 1 169 170
Split                    splitncnn_17             1 3 170 171 172 173
Convolution              conv_43                  1 1 173 174 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456
Swish                    silu_112                 1 1 174 175
Concat                   cat_9                    2 1 175 138 176 0=0
Convolution              conv_44                  1 1 176 177 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_113                 1 1 177 178
Slice                    chunk_2                  1 2 178 179 180 -23300=2,-233,-233 1=0
Split                    splitncnn_18             1 2 180 181 182
Convolution              conv_45                  1 1 182 183 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_114                 1 1 183 184
Convolution              conv_46                  1 1 184 185 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_115                 1 1 185 186
Split                    splitncnn_19             1 3 186 187 188 189
MemoryData               pnnx_fold_639            0 1 190 0=32 1=4 2=80
Reshape                  view_143                 1 1 189 191 0=40 1=40 11=32 2=4
Einsum                   einsum_2                 2 1 191 190 192 -23300=14,105,109,106,107,44,108,105,109,45,62,105,106,107,108
Reduction                max_156                  1 1 192 193 0=4 1=0 -23303=1,-1 4=0 5=1
MemoryData               pnnx_fold_650            0 1 194 0=1 1=1 2=4
BinaryOp                 div_12                   1 1 193 195 0=3 1=1 2=5.656854e+00
BinaryOp                 add_13                   2 1 195 194 196 0=0
Sigmoid                  sigmoid_2                1 1 196 197
Convolution              conv_47                  1 1 188 198 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Reshape                  view_144                 1 1 198 199 0=40 1=40 11=32 2=4
ExpandDims               unsqueeze_161            1 1 197 200 -23303=1,1
BinaryOp                 mul_14                   2 1 199 200 201 0=2
Reshape                  view_145                 1 1 201 202 0=40 1=40 2=128
Concat                   cat_10                   4 1 179 181 187 202 203 0=0
Convolution              conv_48                  1 1 203 204 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_116                 1 1 204 205
Split                    splitncnn_20             1 3 205 206 207 208
Convolution              conv_49                  1 1 208 209 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=589824
Swish                    silu_117                 1 1 209 210
Concat                   cat_11                   2 1 210 105 211 0=0
Convolution              conv_50                  1 1 211 212 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=393216
Swish                    silu_118                 1 1 212 213
Slice                    chunk_3                  1 2 213 214 215 -23300=2,-233,-233 1=0
Split                    splitncnn_21             1 2 215 216 217
Convolution              conv_51                  1 1 217 218 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_119                 1 1 218 219
Convolution              conv_52                  1 1 219 220 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_120                 1 1 220 221
Split                    splitncnn_22             1 3 221 222 223 224
MemoryData               pnnx_fold_733            0 1 225 0=32 1=8 2=80
Reshape                  view_146                 1 1 224 226 0=20 1=20 11=32 2=8
Einsum                   einsum_3                 2 1 226 225 227 -23300=14,105,109,106,107,44,108,105,109,45,62,105,106,107,108
Reduction                max_157                  1 1 227 228 0=4 1=0 -23303=1,-1 4=0 5=1
MemoryData               pnnx_fold_744            0 1 229 0=1 1=1 2=8
BinaryOp                 div_15                   1 1 228 230 0=3 1=1 2=5.656854e+00
BinaryOp                 add_16                   2 1 230 229 231 0=0
Sigmoid                  sigmoid_3                1 1 231 232
Convolution              conv_53                  1 1 223 233 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Reshape                  view_147                 1 1 233 234 0=20 1=20 11=32 2=8
ExpandDims               unsqueeze_162            1 1 232 235 -23303=1,1
BinaryOp                 mul_17                   2 1 234 235 236 0=2
Reshape                  view_148                 1 1 236 237 0=20 1=20 2=256
Concat                   cat_12                   4 1 214 216 222 237 238 0=0
Convolution              conv_54                  1 1 238 239 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_121                 1 1 239 240
Split                    splitncnn_23             1 2 240 241 242
MemoryData               pnnx_377                 0 1 243 0=8400
Convolution              conv_55                  1 1 172 244 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
Swish                    silu_122                 1 1 244 245
Convolution              conv_56                  1 1 245 246 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_123                 1 1 246 247
Convolution              conv_57                  1 1 247 248 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Convolution              conv_58                  1 1 171 249 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_124                 1 1 249 250
Convolution              conv_59                  1 1 250 251 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_125                 1 1 251 252
Convolution              conv_60                  1 1 252 253 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
MemoryData               pnnx_fold_831            0 1 254 0=512 1=80
Einsum                   einsum_4                 2 1 253 254 255 -23300=11,108,106,107,44,105,108,45,62,105,106,107
BinaryOp                 mul_18                   1 1 255 256 0=2 1=1 2=1.786178e+00
BinaryOp                 add_19                   1 1 256 257 0=0 1=1 2=-1.195312e+01
Concat                   cat_13                   2 1 248 257 258 0=0
Convolution              conv_61                  1 1 207 259 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_126                 1 1 259 260
Convolution              conv_62                  1 1 260 261 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_127                 1 1 261 262
Convolution              conv_63                  1 1 262 263 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Convolution              conv_64                  1 1 206 264 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912
Swish                    silu_128                 1 1 264 265
Convolution              conv_65                  1 1 265 266 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_129                 1 1 266 267
Convolution              conv_66                  1 1 267 268 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
MemoryData               pnnx_fold_874            0 1 269 0=512 1=80
Einsum                   einsum_5                 2 1 268 269 270 -23300=11,108,106,107,44,105,108,45,62,105,106,107
BinaryOp                 mul_20                   1 1 270 271 0=2 1=1 2=1.749920e+00
BinaryOp                 add_21                   1 1 271 272 0=0 1=1 2=-1.040625e+01
Concat                   cat_14                   2 1 263 272 273 0=0
Convolution              conv_67                  1 1 242 274 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912
Swish                    silu_130                 1 1 274 275
Convolution              conv_68                  1 1 275 276 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_131                 1 1 276 277
Convolution              conv_69                  1 1 277 278 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Convolution              conv_70                  1 1 241 279 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_132                 1 1 279 280
Convolution              conv_71                  1 1 280 281 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_133                 1 1 281 282
Convolution              conv_72                  1 1 282 283 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
MemoryData               pnnx_fold_920            0 1 284 0=512 1=80
Einsum                   einsum_6                 2 1 283 284 285 -23300=11,108,106,107,44,105,108,45,62,105,106,107
BinaryOp                 mul_22                   1 1 285 286 0=2 1=1 2=1.895814e+00
BinaryOp                 add_23                   1 1 286 287 0=0 1=1 2=-8.867188e+00
Concat                   cat_15                   2 1 278 287 288 0=0
Reshape                  view_149                 1 1 258 289 0=6400 1=144
Reshape                  view_150                 1 1 273 290 0=1600 1=144
Reshape                  view_151                 1 1 288 291 0=400 1=144
Concat                   cat_16                   3 1 289 290 291 292 0=1
Slice                    split_4                  1 2 292 293 294 -23300=2,64,80 1=0
Reshape                  view_152                 1 1 293 295 0=8400 1=16 2=4
Permute                  transpose_158            1 1 295 296 0=2
Softmax                  softmax_5                1 1 296 297 0=0 1=1
Convolution              conv_73                  1 1 297 298 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=16
Reshape                  view_153                 1 1 298 299 0=8400 1=4
MemoryData               pnnx_fold_anchor_points.1 0 1 300 0=8400 1=2
MemoryData               pnnx_fold_anchor_points.1_1 0 1 301 0=8400 1=2
Slice                    chunk_4                  1 2 299 302 303 -23300=2,-233,-233 1=0
BinaryOp                 sub_24                   2 1 300 302 304 0=1
Split                    splitncnn_24             1 2 304 305 306
BinaryOp                 add_25                   2 1 301 303 307 0=0
Split                    splitncnn_25             1 2 307 308 309
BinaryOp                 add_26                   2 1 305 308 310 0=0
BinaryOp                 div_27                   1 1 310 311 0=3 1=1 2=2.000000e+00
BinaryOp                 sub_28                   2 1 309 306 312 0=1
Concat                   cat_17                   2 1 311 312 313 0=0
Reshape                  reshape_136              1 1 243 314 0=8400 1=1
BinaryOp                 mul_29                   2 1 313 314 315 0=2
Sigmoid                  sigmoid_4                1 1 294 316
Concat                   cat_18                   2 1 315 316 out0 0=0
